---
kind: method
id: M:Autodesk.Revit.DB.FailureMessageKey.IsValid
source: html/e16c71d4-3bb6-b39b-8417-dd874e7592e5.htm
---
# Autodesk.Revit.DB.FailureMessageKey.IsValid Method

Checks if the failure message key is valid

## Syntax (C#)
```csharp
public bool IsValid()
```

## Returns
True if the failure message key is valid